Revit 2027 API
AnalysisDisplayStyleDiagramFenceType Enumeration
 Defines fence visualization types for diagram settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleDiagramFenceType
Public Enumeration AnalysisDisplayStyleDiagramFenceType
public enum class AnalysisDisplayStyleDiagramFenceType
type AnalysisDisplayStyleDiagramFenceType
Members
Member name | Value | Description
ShowAll | 0 |  Show fence for each point
ShowNone | 1 |  Don't show fence
ShowPredefined | 2 |  Show fence only for points that have flag ValueAtPointFlags::DisplayFence
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace